DmitriyKunitsin/STM32/Manchester/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DA0_Pin GPIO_PIN_0
#define DA0_GPIO_Port GPIOA
#define DA1_Pin GPIO_PIN_1
#define DA1_GPIO_Port GPIOA
#define DA2_Pin GPIO_PIN_2
#define DA2_GPIO_Port GPIOA
#define DA3_Pin GPIO_PIN_3
#define DA3_GPIO_Port GPIOA
#define DA4_Pin GPIO_PIN_4
#define DA4_GPIO_Port GPIOA
#define DA5_Pin GPIO_PIN_5
#define DA5_GPIO_Port GPIOA
#define DA6_Pin GPIO_PIN_6
#define DA6_GPIO_Port GPIOA
#define DA7_Pin GPIO_PIN_7
#define DA7_GPIO_Port GPIOA
#define ASD_Pin GPIO_PIN_1
#define ASD_GPIO_Port GPIOB
#define AWRH_2byte_Pin GPIO_PIN_2
#define AWRH_2byte_GPIO_Port GPIOB
#define AWRL_1byte_Pin GPIO_PIN_12
#define AWRL_1byte_GPIO_Port GPIOB
#define ARDL_1byte_Pin GPIO_PIN_13
#define ARDL_1byte_GPIO_Port GPIOB
#define ANED_Pin GPIO_PIN_14
#define ANED_GPIO_Port GPIOB
#define AMODE_Pin GPIO_PIN_15
#define AMODE_GPIO_Port GPIOB
#define AINTRX_Pin GPIO_PIN_8
#define AINTRX_GPIO_Port GPIOA
#define AINTTX_Pin GPIO_PIN_11
#define AINTTX_GPIO_Port GPIOA
#define ARDH_2byte_Pin GPIO_PIN_5
#define ARDH_2byte_GPIO_Port GPIOB
#define ACHD_Pin GPIO_PIN_7
#define ACHD_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
